namespace Final_Project
{
    internal class Program
    {
        //        // 4. ------------------- Автомат гарячих напоїв. 
        //        Створити ієрархію класів для подання гарячих напоїв Автомату(кава, чай, капучіно та ін.)
        //Створити програму для роботи Автомату у  режимах адмін та користувач
        //У режимі адміна передбачити

        //    Завантаження автомату водою, кава, чай, цукор
        //    Вивід статистики наявності складових для приготування напоїв

        //    Зміна цін на напої

        //    Вилучення кешу
        //У режимі користувача передбачити
        //Замовлення напою(+ оплата)

        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}